# vim:ft=ruby:

cask_args appdir: '/Applications'

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"

# Core
brew "ack"
brew "bash"
brew "coreutils"
brew "curl"
brew "fish"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gnupg"
# https://hub.github.com/
brew "hub"
brew "mas"
brew "openssl"
brew "rsync"
brew "wget"
brew "zsh"

# Languages
brew "nodenv"
brew "pyenv"
brew "rbenv"
brew "yarn"

# Core utils
brew "jq"
# brew "ranger"
brew "tree"

# Core apps
brew "neovim"
brew "tmux"
brew "vifm"
# brew "youtube-dl"

# Nice to have
brew "editorconfig"
brew "figlet"
brew "neofetch"
# brew "nnn"
brew "wrk"

# Apps
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "bartender"
cask "brave-browser"
cask "cleanmymac"
cask "dash"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "imageoptim"
# cask "kitty"
cask "alakritty"
cask "little-snitch"
cask "paw"
cask "rectangle"
cask "sketch"
cask "slack"
cask "telegram"
cask "the-unarchiver"
cask "tower"
cask "visual-studio-code"

# AppStore Apps
mas "jira-cloud-by-atlassian", id: 1475897096
mas "things-3", id: 904280696
mas "xcode", id: 497799835
