tap "oven-sh/bun"
tap "jesseduffield/lazygit"
tap "supabase/tap"

# Core
# brew "clang-format"
brew "coreutils"
brew "gnupg"
brew "gnu-sed"
# brew "gpg2"  # Replaced by gnupg
brew "neovim"
brew "openssl@3"
# brew "openssh"

# Filesystem / Network
brew "ack"
brew "curl"
brew "rsync"
brew "sshuttle"
brew "tree"
brew "wget"
brew "zoxide"

# Tools
brew "ansible"
brew "atmos"
brew "awscli"
brew "editorconfig"
brew "helm"
brew "jq"
brew "make"
# brew "maven"
brew "pipx"
brew "stow"
brew "terraform"
brew "tmux"
brew "vifm"
brew "supabase/tap/supabase"
brew "zellij"

# Shells
brew "bash"
brew "fish"
brew "zsh"

# Language Tools
brew "fnm"
brew "jenv"
brew "pyenv"
brew "rbenv"
brew "zig"

# Package Managers
brew "mas"
brew "uv" # An extremely fast Python package and project manager, written in Rust.
# brew "yarn"

# All-in-one toolkit for JavaScript and TypeScript
brew "bun"

# Version Control
brew "gh"
brew "git-flow"
brew "git"
brew "glab"
brew "hub"
brew "lazygit"
brew "stgit"

# Databases
brew "redis"

# Media
brew "imagemagick"

# Container Tools
# brew "colima"
brew "docker-compose"
# brew "lima"

# Development Tools
brew "gemini-cli"
# brew "moon"
# brew "node"

# Misc
brew "starship"
brew "fzf"
